{
    "questions": [],
    "hi": "Hi there!",
    "how are you": "I am fine, what about you",
    "what can you do": "I can assist you with various tasks. Just ask me anything!",
    "bye": "Goodbye! Have a great day!",
    "what is your name": "My name is Zira",
    "who created you": "I was Created by Shivam Sohel Zumair ",
    "what was your purpose of creation": "I dont know the exact detail but I am sure it was for fun",
    "how to update your data": "To update my data you can simply keep asking me new question and then keep providing the answer",
    "can you tell me a joke": "Sure! Why don't scientists trust atoms? Because they make up everything!",
    "Who are you": "I am Zira a bot created for fun",
    "do you know about blackbox": "It is an Ai software specialized to write code",
    "thank you": " I feel Good that I can Assist you",
    "how many contients are there in world": "7 contienent are there in the world",
    "where are you located": "I exist in the digital realm, so you can interact with me from anywhere with an internet connection.",
    "how old are you?": " I don't have an age as I'm just a computer program",
    "what is the meaning of life": "The meaning of life is a philosophical question that different people interpret in different ways. Some believe it's about finding happiness, others see it as fulfilling a purpose or contributing to society.",
    "how do i reset my password?": "To reset your password, go to the login page and click on the \"Forgot Password\" link. Follow the instructions to reset your password.",
    "what's the tallest mountain in the world": "The tallest mountain in the world is Mount Everest, located in the Himalayas on the border between Nepal and China. Its peak reaches an elevation of 29,032 feet (8,849 meters) above sea level.",
    "what's the best way to stay healthy": "Staying healthy involves maintaining a balanced diet, exercising regularly, getting enough sleep, managing stress, and avoiding harmful habits like smoking and excessive drinking.",
    "can you recommend a good book to read": "Sure! One popular book that many people enjoy is \"To Kill a Mockingbird\" by Harper Lee. It's a classic novel that explores themes of justice, morality, and compassion.",
    "how do plants convert sunlight into energy": "Plants use a process called photosynthesis to convert sunlight into energy. They absorb light energy through chlorophyll, a pigment in their leaves, and use it to convert carbon dioxide and water into glucose (sugar) and oxygen.",
    "what is the meaning of deja vu": "Deja vu is a phenomenon where an individual feels like they've experienced a current situation before, even though they haven't",
    "what is the world's largest desert": "Contrary to popular belief, the world's largest desert is not the Sahara, but the Antarctic Desert. It covers the entire continent of Antarctica and is classified as a cold desert due to its low precipitation.",
    "what is the speed of light": "The speed of light in a vacuum is approximately 299,792 kilometers per second",
    "what is the longest river in the world": "The Nile River in Africa is considered the longest river in the world",
    "what is the largest mammal on earth": "The blue whale holds the title for being the largest mammal on Earth",
    "what is shutdown": "it is a method of turning something of",
    "how r u": "I am fine, what about you",
    "hu r u": "I am Zira",
    "None": "Sorry I was not able to hear",
    "none": " ",
    "hello": "hello nice to meet you",
    "Tell me a fact": "The shortest war in history lasted only 38 minutes between Britain and Zanzibar on August 27, 1896.",
    "What is your favorite color?": "I don't have a favorite color, but I like all colors equally!",
    "can you help me with my homework": "yes, i can certainly try! please tell me what you need help with.",
    "what is artificial intelligence": "artificial intelligence (ai) refers to the simulation of human intelligence in machines that are programmed to think and learn like humans.",
    "what is machine learning": "machine learning is a subset of artificial intelligence that enables computers to learn and improve from experience without being explicitly programmed.",
    "what is deep learning": "deep learning is a subset of machine learning that uses artificial neural networks with multiple layers to progressively extract higher-level features from raw input.",
    "who is elon musk": "elon musk is a business magnate, industrial designer, and engineer. he is the founder, ceo, and lead designer of spacex; early investor, ceo, and product architect of tesla, inc.; founder of the boring company; co-founder of neuralink; and co-founder and initial co-chairman of openai.",
    "tell me a fun fact": "sea otters hold hands while sleeping to keep from drifting apart.",
    "what is the capital of france": "the capital of france is paris.",
    "what is the boiling point of water": "the boiling point of water is 100 degrees celsius (212 degrees fahrenheit) at sea level.",
    "what is the formula for the area of a circle": "the formula for the area of a circle is pie r square",
    "what is the chemical symbol for gold": "the chemical symbol for gold is au.",
    "what are the primary colors": "the primary colors are red, blue, and yellow.",
    "who wrote the play 'romeo and juliet'": "the play 'romeo and juliet' was written by william shakespeare",
    "what is the largest planet in our solar system?": "jupiter is the largest planet in our solar system.",
    "who was the first person to step on the moon": "neil armstrong was the first person to step on the moon.",
    "what is the powerhouse of the cell": "the mitochondria is often referred to as the powerhouse of the cell.",
    "what is the formula for the pythagorean theorem": "the formula for the pythagorean theorem is a² + b² = c², where 'a' and 'b' are the lengths of the two shorter sides of a right triangle, and 'c' is the length of the hypotenuse.",
    "who painted the mona lisa": "the mona lisa was painted by leonardo da vinci.",
    "what is the currency of japan": "the currency of japan is the japanese yen.",
    "what is the formula for density": "the formula for density is density = mass / volume.",
    "what is the speed of sound in air": "the speed of sound in air is approximately 343 meters per second (at room temperature and pressure).",
    "what is the capital of spain": "the capital of spain is madrid",
    "what is the largest ocean on earth": "the largest ocean on earth is the pacific ocean",
    "who invented the telephone": "the telephone was invented by alexander graham bell",
    "who wrote harry potter": "the 'harry potter' series was written by j.k. rowling",
    "what is the chemical symbol for water": "the chemical symbol for water is h2o.",
    "who is the current president of the united states": "as of 2024, the current president of the united states is Joe Biden",
    "what is the meaning of ai": "ai stands for artificial intelligence, which refers to the simulation of human intelligence in machines programmed to think and learn like humans.",
    "what is the meaning of nasa":"nasa stands for the national aeronautics and space administration, an independent agency of the united states federal government responsible for the civilian space program, as well as aeronautics and aerospace research.",
    "who wrote romeo and juliet" : "William Shakespeare",
    "what is the tallest mammal" : "Giraffe",
    "what year did the titanic sink" : "1912",
    "who was the first man to step on the moon" : "Neil Armstrong",
    "what is the hardest natural substance on earth" : "Diamond",
    "what is the closest planet to the sun" : "Mercury",
    "what is the capital of australia" : "Canberra",
    "who wrote the harry potter series" : "J.K. Rowling",
    "who painted the starry night" : "Vincent van Gogh",
    "what is the largest planet in our solar system" : "Jupiter",
    "what is the currency of the united kingdom" : "Pound",
    "who was the first woman to win a nobel prize" : "Marie Curie",
    "what is the largest desert in the world" : "Sahara",
    "what is the largest country by land area" : "Russia",
    "who wrote the odyssey" : "Homer",
    "what is the chemical symbol for silver" : "Ag",
    "who painted the last supper" : "Leonardo da Vinci",
    "what is the smallest planet in our solar system" : "Mercury",
    "what is the currency of china" : "Yuan",
    "who was the first president of the united states" : "George Washington",
    "what is the smallest country in the world" : "Vatican",
    "what is the capital of canada" : "Ottawa",
    "who wrote the iliad" : "Homer",
    "what is the chemical symbol for sodium" : "Na",
    "who painted the birth of venus" : "Sandro Botticelli",
    "what is the currency of india" : "Rupee",
    "who was the first female prime minister of a country" : "Sirimavo Bandaranaike",
    "what is the tallest mountain in the world" : "Mount Everest",
    "what is the smallest bone in the human body" : "Stapes",
    "what is the capital of brazil" : "Brasília",
    "who wrote the divine comedy" : "Dante Alighieri",
    "what is the chemical symbol for potassium" : "K",
    "who painted the creation of adam" : "Michelangelo",
    "what is the longest bone in the human body" : "Femur",
    "what is the currency of russia" : "Ruble",
    "who was the first woman to fly solo across the atlantic" : "Amelia Earhart",
    "what is the largest island in the world" : "Greenland"
}